___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [14]:
df.head(10)

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [11]:
# df[df['Company']=='CarlSarah']

In [20]:
df[df['Company']=='FB']['Sales']

4    243
5    350
Name: Sales, dtype: int64

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [15]:
df.groupby('Company')

You can save this object as a new variable:

In [21]:
by_comp = df.groupby("Company").mean(numeric_only=True)

And then call aggregate methods off the object:

In [22]:
by_comp.mean()

Sales    229.5
dtype: float64

In [31]:
# df.groupby('Company').mean()

More examples of aggregate methods:

In [24]:
by_comp.std()

Sales    68.284332
dtype: float64

In [25]:
by_comp.min()

Sales    160.0
dtype: float64

In [26]:
by_comp.max()

Sales    296.5
dtype: float64

In [27]:
by_comp.count()

Sales    3
dtype: int64

In [28]:
by_comp.describe()

            Sales
count    3.000000
mean   229.500000
std     68.284332
min    160.000000
25%    196.000000
50%    232.000000
75%    264.250000
max    296.500000

In [29]:
by_comp.describe().transpose()

       count   mean        std    min    25%    50%     75%    max
Sales    3.0  229.5  68.284332  160.0  196.0  232.0  264.25  296.5

In [32]:
by_comp.describe().transpose()

       count   mean        std    min    25%    50%     75%    max
Sales    3.0  229.5  68.284332  160.0  196.0  232.0  264.25  296.5

# Great Job!